SR-Coder/accDbMeter/sensor/esp32-s3-DevKitC/include/ESPNtpClient.h
/**
  * @file ESPNtpClient.h
  * @version 0.2.6
  * @date 29/12/2021
  * @author German Martin
  * @brief Library to get system sync from a NTP server with microseconds accuracy in ESP8266 and ESP32
  */

#ifndef _EspNtpClient_h
#define _EspNtpClient_h

#if defined(ARDUINO) && ARDUINO >= 100
#include "Arduino.h"
#else
#include "WProgram.h"
#endif

#include <functional>
//using namespace std;
//using namespace placeholders;

extern "C" {
#include "lwip/init.h"
#include "lwip/ip_addr.h"
#include "lwip/err.h"
#include "lwip/dns.h"
#include "sys/time.h"
#include "time.h"
#include "lwip/udp.h"
#include "lwip/ip_addr.h"
}

#ifdef ESP32
#include "TZdef.h"
#else
#include "TZ.h"
#endif

constexpr auto DEFAULT_NTP_SERVER = "pool.ntp.org"; ///< @brief Default international NTP server. I recommend you to select a closer server to get better accuracy
constexpr auto DEFAULT_NTP_PORT = 123; ///< @brief Default local udp port. Select a different one if neccesary (usually not needed)
constexpr auto DEFAULT_NTP_INTERVAL = 1800; ///< @brief Default sync interval 30 minutes
constexpr auto DEFAULT_NTP_SHORTINTERVAL = 15; ///< @brief Sync interval when sync has not been achieved. 15 seconds
constexpr auto DEFAULT_NTP_TIMEOUT = 5000; ///< @brief Default NTP timeout ms
//constexpr auto FAST_NTP_SYNCNTERVAL = DEFAULT_NTP_TIMEOUT * 1.1; ///< @brief Sync interval when sync has not reached required accuracy in ms
constexpr auto MIN_NTP_TIMEOUT = 250; ///< @brief Minumum admisible ntp timeout in ms
constexpr auto MIN_NTP_INTERVAL = 10; ///< @brief Minumum NTP request interval in seconds
constexpr auto DEFAULT_MIN_SYNC_ACCURACY_US = 5000; ///< @brief Minimum sync accuracy in us
constexpr auto DEFAULT_MAX_RESYNC_RETRY = 3; ///< @brief Maximum number of sync retrials if offset is above accuravy
constexpr auto DEAULT_NUM_TIMEOUTS = 3; ///< @brief After this number of timeouts there is no more continiuos
#ifdef ESP8266
constexpr auto ESP8266_LOOP_TASK_INTERVAL = 500; ///< @brief Loop task period on ESP8266
constexpr auto ESP8266_RECEIVER_TASK_INTERVAL = 100; ///< @brief Receiver task period on ESP8266
#endif // ESP8266
constexpr auto DEFAULT_TIME_SYNC_THRESHOLD = 2500; ///< @brief If calculated offset is less than this in us clock will not be corrected
constexpr auto DEFAULT_NUM_OFFSET_AVE_ROUNDS = 1; ///< @brief Number of NTP request and response rounds to calculate offset average
constexpr auto MAX_OFFSET_AVERAGE_ROUNDS = 5; ///< @brief Maximum number of NTP request for offset average calculation

constexpr auto TZNAME_LENGTH = 60; ///< @brief Max TZ name description length
constexpr auto SERVER_NAME_LENGTH = 40; ///< @brief Max server name (FQDN) length
constexpr auto NTP_PACKET_SIZE = 48; ///< @brief NTP time is in the first 48 bytes of message

/* Useful Constants */
#ifndef SECS_PER_MIN
constexpr auto SECS_PER_MIN = ((time_t)(60UL));
#endif
#ifndef SECS_PER_HOUR
constexpr auto SECS_PER_HOUR = ((time_t)(3600UL));
#endif
#ifndef SECS_PER_DAY
constexpr auto SECS_PER_DAY = ((time_t)(SECS_PER_HOUR * 24UL));
#endif
#ifndef DAYS_PER_WEEK
constexpr auto DAYS_PER_WEEK = ((time_t)(7UL));
#endif
#ifndef SECS_PER_WEEK
constexpr auto SECS_PER_WEEK = ((time_t)(SECS_PER_DAY * DAYS_PER_WEEK));
#endif
#ifndef SECS_PER_YEAR
constexpr auto SECS_PER_YEAR = ((time_t)(SECS_PER_DAY * 365UL));
#endif
#ifndef SECS_YR_2000
constexpr auto SECS_YR_2000 = ((time_t)(946684800UL)); ///< @brief The time at the start of y2k
#endif

#ifdef ESP32
#include <WiFi.h>
#else
#include <ESP8266WiFi.h>
#endif
#include <Ticker.h>

#include "NTPEventTypes.h"

  /**
    * @brief NTP client status code
    */
typedef enum NTPStatus {
    syncd = 0, // Time synchronized correctly
    unsyncd = -1, // Time may not be valid
    partialSync = 1 // NPT is synchronised but precission is below threshold
} NTPStatus_t; // Only for internal library use

  /**
    * @brief Flags in NTP packet
    */
typedef struct {
    /**
      * @brief 2-bit integer warning of an impending leap
      * second to be inserted or deleted in the last minute of the current
      * month with values defined in this table
      * 
      * | Value | Meaning |
      * |:----------:|-------------|
      * | 0     | no warning                             |
      * | 1     | last minute of the day has 61 seconds  |
      * | 2     | last minute of the day has 59 seconds  |
      * | 3     | unknown (clock unsynchronized)         |
      */
    int li;
    int vers; ///< @brief 3-bit integer representing the NTP version number, currently 4
    /**
      * @brief 3-bit integer representing the mode, with values defined in this table
      * 
      * | Value | Meaning                  |
      * |:-----:|--------------------------|
      * | 0     | reserved                 |
      * | 1     | symmetric active         |
      * | 2     | symmetric passive        |
      * | 3     | client                   |
      * | 4     | server                   |
      * | 5     | broadcast                |
      * | 6     | NTP control message      |
      * | 7     | reserved for private use |
      */
    int mode;
} NTPFlags_t;

  /**
    * @brief NTP packet structure
    */
typedef struct {
    bool valid = false; ///< @brief true if following data is valid
    NTPFlags_t flags; ///< @brief NTP packet flags as NTPFlags_t
    
    /**
      * @brief 8-bit integer representing the stratum
      * 
      * | Value  | Meaning                                             |
      * |:------:|-----------------------------------------------------|
      * | 0      | unspecified or invalid                              |
      * | 1      | primary server (e.g., equipped with a GPS receiver) |
      * | 2-15   | secondary server (via NTP)                          |
      * | 16     | unsynchronized                                      |
      * | 17-255 | reserved                                            |
      */
    uint8_t peerStratum;
    
     /**
      * @brief Maximum interval between successive messages, in seconds.
      *
      * Calculated from 8-bit signed integer representing log2 value. Suggested default limits for 
      * minimum and maximum poll intervals are 6 and 10, what represent 64 to 1024 seconds, respectively
      */
    uint32_t pollingInterval;
    
    /**
      * @brief 8-bit signed integer representing the precision of the
      * system clock, in log2 seconds
      * 
      * For instance, a value of -18 corresponds to a precision of about one microsecond.
      * The precision can be determined when the service first starts up as the minimum
      * time of several iterations to read the system clock
      */
    float clockPrecission;
       
    float rootDelay; ///< @brief Total round-trip delay to the reference clock
    
    float dispersion; ///< @brief Total dispersion to the reference clock
    
     /**
      * @brief 32-bit code identifying the particular server or reference clock
      * 
      * The interpretation depends on the value in the stratum field.
      * For packet stratum 0 (unspecified or invalid), this is a four-character ASCII [RFC1345] string,
      * called the "kiss code", used for debugging and monitoring purposes. For stratum 1 (reference
      * clock), this is a four-octet, left-justified, zero-padded ASCII string assigned to the
      * reference clock. 
      * 
      * The authoritative list of Reference Identifiers is maintained by IANA; however, any string
      * beginning with the ASCII character "X" is reserved for unregistered experimentation and 
      * development. Next identifiers have been used as ASCII identifiers:
      * 
      * | ID   | Clock Source                                             |
      * |:----:|----------------------------------------------------------|
      * | GOES | Geosynchronous Orbit Environment Satellite               |
      * | GPS  | Global Position System                                   |
      * | GAL  | Galileo Positioning System                               |
      * | PPS  | Generic pulse-per-second                                 |
      * | IRIG | Inter-Range Instrumentation Group                        |
      * | WWVB | LF Radio WWVB Ft. Collins, CO 60 kHz                     |
      * | DCF  | LF Radio DCF77 Mainflingen, DE 77.5 kHz                  |
      * | HBG  | LF Radio HBG Prangins, HB 75 kHz                         |
      * | MSF  | LF Radio MSF Anthorn, UK 60 kHz                          |
      * | JJY  | LF Radio JJY Fukushima, JP 40 kHz, Saga, JP 60 kHz       |
      * | LORC | MF Radio LORAN C station, 100 kHz                        |
      * | TDF  | MF Radio Allouis, FR 162 kHz                             |
      * | CHU  | HF Radio CHU Ottawa, Ontario                             |
      * | WWV  | HF Radio WWV Ft. Collins, CO                             |
      * | WWVH | HF Radio WWVH Kauai, HI                                  |
      * | NIST | NIST telephone modem                                     |
      * | ACTS | NIST telephone modem                                     |
      * | USNO | USNO telephone modem                                     |
      * | PTB  | European telephone modem                                 |
      * 
      * Above stratum 1 (secondary servers and clients): this is the reference identifier of
      * the server and can be used to detect timing loops. If using the IPv4 address family,
      * the identifier is the four-octet IPv4 address. If using the IPv6 address family, it is the
      * first four octets of the MD5 hash of the IPv6 address. Note that, when using the IPv6 address
      * family on an NTPv4 server with a NTPv3 client, the Reference Identifier field appears to be a 
      * random value and a timing loop might not be detected
      */
    uint8_t refID[4];
    
    timeval reference; ///< @brief Time when the system clock was last set or corrected
    timeval origin; ///< @brief Time at the client when the request departed for the server
    timeval receive; ///< @brief Time at the server when the request arrived from the client
    timeval transmit; ///< @brief Time at the server when the response left for the client
    timeval destination; ///< Time at the client when the reply arrived from the server, in NTP timestamp format
} NTPPacket_t;

typedef std::function<void (NTPEvent_t)> onSyncEvent_t; ///< @brief Event notifier callback

static char strBuffer[35]; ///< @brief Temporary buffer for time and date strings

/**
  * @brief NTPClient class
  */
class NTPClient {
protected:
    udp_pcb* udp;                   ///< @brief UDP connection object
    timeval lastSyncd;              ///< @brief Stored time of last successful sync
    timeval firstSync;              ///< @brief Stored time of first successful sync after boot
    timeval packetLastReceived;     ///< @brief Moment when a NTP response has arrived
    bool ntpRequested = false;      ///< @brief Indicates that a NTP response is pending
    unsigned long uptime = 0;       ///< @brief Time since boot
    unsigned int shortInterval = DEFAULT_NTP_SHORTINTERVAL * 1000;  ///< @brief Interval to set periodic time sync until first synchronization.
    unsigned int longInterval = DEFAULT_NTP_INTERVAL * 1000;        ///< @brief Interval to set periodic time sync
    unsigned int actualInterval = DEFAULT_NTP_SHORTINTERVAL * 1000; ///< @brief Currently selected interval
    onSyncEvent_t onSyncEvent;      ///< @brief Event handler callback
    uint16_t ntpTimeout = DEFAULT_NTP_TIMEOUT;                      ///< @brief Response timeout for NTP requests
    long minSyncAccuracyUs = DEFAULT_MIN_SYNC_ACCURACY_US;          ///< @brief DEfault minimum offset value to consider a good sync
    unsigned int maxNumSyncRetry = DEFAULT_MAX_RESYNC_RETRY;                ///< @brief Number of resync repetitions if minimum accuracy has not been reached
    unsigned int numSyncRetry;              ///< @brief Current resync repetition
    unsigned int maxDispersionErrors = DEFAULT_MAX_RESYNC_RETRY;            ///< @brief Number of resync repetitions if server has a dispersion value bigger than offset absolute value
    unsigned int numDispersionErrors;
    long timeSyncThreshold = DEFAULT_TIME_SYNC_THRESHOLD;           ///< @brief If calculated offset is below this threshold it will not be applied. 
                                                                    //            This is to avoid continious innecesary glitches in clock
    unsigned int numTimeouts = 0;           ///< @brief After this number of timeout responses ntp sync time is increased
    NTPStatus_t status = unsyncd;   ///< @brief Sync status
    char ntpServerName[SERVER_NAME_LENGTH];                         ///< @brief  of NTP server on Internet or LAN
    IPAddress ntpServerIPAddress;   ///< @brief  IP address of NTP server on Internet or LAN
    bool manageWifi = true;   ///< @brief  Enables this library to manage wifi reconnection. True by default
public:
#ifdef ESP32
    //bool terminateTasks = false;
    TaskHandle_t loopHandle = NULL;                                 ///< @brief TimeSync loop task handle
    TaskHandle_t receiverHandle = NULL;                             ///< @brief NTP response receiver task handle
#else
    Ticker loopTimer;               ///< @brief Timer to trigger timesync
    Ticker receiverTimer;           ///< @brief Timer to check received responses
#endif
protected:
    Ticker responseTimer;           ///< @brief Timer to trigger response timeout
    bool isConnected = false;       ///< @brief True if client has resolved correctly server IP address
    double offset;                  ///< @brief Temporary offset storage for event notify
    double delay;                   ///< @brief Temporary delay storage for event notify
    timezone timeZone;              ///< @brief 
    char tzname[TZNAME_LENGTH];     ///< @brief Configuration string for local time zone
    
