SR-Coder/accDbMeter/sensor/esp32-s3-DevKitC/include/ESPNtpClient.h
    int64_t offsetSum;              ///< @brief Sum of offsets for average calculation
    int64_t offsetAve;              ///< @brief Average calculated value
    unsigned int round = 0;                 ///< @brief Number of offset values added during last sync 
    unsigned int numAveRounds = DEFAULT_NUM_OFFSET_AVE_ROUNDS;          ///< @brief Number of request to be done to calculate average.
    
    pbuf* lastNtpResponsePacket;    ///< @brief Last response packet to be processed by receiver task
    bool responsePacketValid = false;                           ///< @brief Is `lastNtpResponsePacket` already processed?
    
    /**
      * @brief Gets time from NTP server and convert it to Unix time format
      * @param arg `NTPClient` instance
      */
    static void s_getTimeloop (void* arg);
    
    /**
      * @brief Static method that calls `recvPacket`. Used in receiver task
      * @param arg user supplied argument (udp_pcb.recv_arg)
      * @param pcb the udp_pcb which received data
      * @param p the packet buffer that was received
      * @param addr the remote IP address from which the packet was received
      * @param port the remote port from which the packet was received
      */
    static void s_recvPacket (void* arg, struct udp_pcb* pcb, struct pbuf* p,
                              const ip_addr_t* addr, u16_t port);
    
    /**
      * @brief Receiver task to check for received packets and launch packet processor
      * @param arg `NTPClient` instance
      */ 
    static void s_receiverTask (void* arg);
    
    /**
      * @brief Checks if received packet may be used to get a good sync
      * @param ntpPacket Packet to analyze
      * @param offsetUs Microseconds offset, used to check dispersion
      * @return `true` if NTP packet is good for sync
      */
    bool checkNTPresponse (NTPPacket_t* ntpPacket, int64_t offsetUs);
    
    /**
      * @brief Write NTP packet data to Serial monitor
      * @param decPacket Packet to analyze
      */
    void dumpNtpPacketInfo (NTPPacket_t* decPacket);
    
    /**
      * @brief Static method to call NTP response timeout processor
      */
    static void s_processRequestTimeout (void* arg);
    
    /**
      * @brief Process internal state in case of a response timeout. If a response comes later is is asumed as non valid
      */
    void processRequestTimeout ();
    
    /**
      * @brief Sends NTP request to server
      * @return false in case of any error
      */
    boolean sendNTPpacket ();
    
       
    /**
      * @brief Gets packet response and update time as of its data
      * @param p UDP response packet
      */
    void processPacket (struct pbuf* p);
    
    /**
      * @brief Decodes NTP response contained in buffer
      * @param messageBuffer Pointer to message buffer
      * @param len Buffer len
      * @param decPacket Pointer to packet to store decoded data
      * @return Decoded packet from message
      */
    NTPPacket_t* decodeNtpMessage (uint8_t* messageBuffer, size_t len, NTPPacket_t* decPacket);

    /**
      * @brief Calculates offset from NTP response packet
      * @param ntpPacket NTP response packet structure
      * @return Time offset in `timeval` format
      */
    timeval calculateOffset (NTPPacket_t* ntpPacket);
    
    /**
      * @brief Applies offset to system clock
      * @param offset Calculated offset
      * @return `true` if process finished without errors
      */
    bool adjustOffset (timeval* offset);

public:
    /**
      * @brief NTP client Class destructor
      */
    ~NTPClient () {
        stop ();
    }
    
    /**
      * @brief Cleans data and stops all tasks
      */
    void stop (){
#ifdef ESP32
        if (loopHandle) {
            vTaskDelete (loopHandle);
            //DEBUGLOGI ("Loop task handle deleted");
            loopHandle = NULL;
        }
        if (receiverHandle) {
            vTaskDelete (receiverHandle);
            //DEBUGLOGI ("Receiver task handle deleted");
            receiverHandle = NULL;
        }
#else
        loopTimer.detach ();
        receiverTimer.detach ();
#endif // ESP8266
        responseTimer.detach ();
#ifdef ESP8266
        if (udp) {
            udp_remove (udp);
        }
        // if (lastNtpResponsePacket) {
        //     pbuf_free (lastNtpResponsePacket);
        // }
#endif // ESP8266
    }
    
    /**
      * @brief Starts a NTP time request to server. Only called from library, normally.
      * 
      * Kept in public section to allow direct NTP request.
      */
    void getTime ();

    /**
      * @brief Starts time synchronization
      * @param ntpServerName NTP server name as String
      * @param manageWifi `true` if WiFi should be managed by library
      * @return `true` if everything went ok
      */
    bool begin (const char* ntpServerName = NULL, bool manageWifi = true);
    
    /**
      * @brief Sets NTP server name
      * @param serverName New NTP server name
      * @return `true` if everything went ok
      */
    bool setNtpServerName (const char* serverName);
    
    /**
     * @brief Gets NTP server name
     * @return NTP server name
     */
    char* getNtpServerName () {
        return ntpServerName;
    }
    
    /**
      * @brief Set a callback that triggers after a sync event
      * @param handler function with `onSyncEvent_t` to notify events to user code
      */
    void onNTPSyncEvent (onSyncEvent_t handler){
        if (handler){
            onSyncEvent = handler;
        }
    }
    
    /**
      * @brief Changes sync period
      * @param interval New interval in seconds
      * @return True if everything went ok
      */
    bool setInterval (int interval);
    
    /**
      * @brief Changes sync period in sync'd and unsync'd status
      * @param shortInterval New interval while time is not first adjusted yet, in seconds
      * @param longInterval New interval for normal operation, in seconds
      * @return True if everything went ok
      */
    bool setInterval (int shortInterval, int longInterval);
    
    /**
      * @brief Gets sync period
      * @return Interval for normal operation, in seconds
      */
    int getInterval () {
        return actualInterval / 1000;
    }

    /**
      * @brief Gets sync period while not sync'd status
      * @return Interval while time is not first adjusted yet, in seconds
      */
    int	getShortInterval () {
        return shortInterval / 1000;
    }

    /**
      * @brief Gets sync period
      * @return Interval for normal operation in seconds
      */
    int	getLongInterval () { 
        return longInterval / 1000;
    }

    /**
      * @brief Sets minimum sync accuracy to get a new request if offset is greater than this value
      * @param accuracy Desired minimum accuracy
      */
    void setMinSyncAccuracy (long accuracy) {
        const int minAccuracy = 100;

        if (accuracy > minAccuracy) {
            minSyncAccuracyUs = accuracy;
        } else {
            minSyncAccuracyUs = minAccuracy;
        }
    }
    
    /**
      * @brief Sets time sync threshold. If offset is under this value time will not be adjusted
      * @param threshold Desired sync threshold
      */
    void settimeSyncThreshold (long threshold) {
        const int minThreshold = 100;
        
        if (threshold > minThreshold) {
            timeSyncThreshold = threshold;
        } else {
            timeSyncThreshold = minThreshold;
        }
    }
    
    /**
      * @brief Sets max number of sync retrials if minimum accuracy has not been reached
      * @param maxRetry Max sync retrials number
      */
    void setMaxNumSyncRetry (unsigned long maxRetry) {
            maxNumSyncRetry = maxRetry;
    }

    /**
      * @brief Configures response timeout for NTP requests
      * @param milliseconds error code. `false` in case of error
      */
    bool setNTPTimeout (uint16_t milliseconds);

    /**
      * @brief Sets time zone for getting local time
      * @param TZ Time zone description
      */
    void setTimeZone (const char* TZ){
        strncpy (tzname, TZ, TZNAME_LENGTH);
        setenv ("TZ", tzname, 1);
        tzset ();
    }
    
    /**
      * @brief Converts current time to a char string
      * @return String built from current time
      */
    char* getTimeStr () {
        time_t currentTime = time (NULL);
        return getTimeStr (currentTime);
    }

    /**
      * @brief Converts a time in UNIX format to a char string representing time
      * @param moment `timeval` object to convert to extract time
      * @return String built from given time
      */
    char* getTimeStr (timeval moment) {
        tm* local_tm = localtime (&moment.tv_sec);
        size_t index = strftime (strBuffer, sizeof (strBuffer), "%H:%M:%S", local_tm);
        snprintf (strBuffer + index, sizeof (strBuffer) - index, ".%06ld", moment.tv_usec);
        return strBuffer;
    }
    
    /**
      * @brief Converts a time in UNIX format to a char string representing time
      * @param moment `time_t` value (UNIXtime) to convert to extract time
      * @return String built from given time
      */
    char* getTimeStr (time_t moment) {
        tm* local_tm = localtime (&moment);
        strftime (strBuffer, sizeof(strBuffer), "%H:%M:%S", local_tm);
        return strBuffer;
    }

    /**
    * @brief Converts current date to a char string
    * @return String built from current date
    */
    char* getDateStr () {
        time_t currentTime = time (NULL);
        return getDateStr (currentTime);
    }

    /**
    * @brief Converts a time in UNIX format to a char string representing its date
    * @param moment `timeval` object to convert to extract date
    * @return String built from given time
    */
    char* getDateStr (timeval moment) {
        return getDateStr (moment.tv_sec);
    }
    
    /**
    * @brief Converts a time in UNIX format to a char string representing its date
    * @param moment time_t object to convert to extract date
    * @return String built from given time
    */
    char* getDateStr (time_t moment) {
        tm* local_tm = localtime (&moment);
        strftime (strBuffer, sizeof (strBuffer), "%02d/%m/%04Y", local_tm);
        return strBuffer;
    }
    
    /**
    * @brief Converts current time and date to a char string
    * @param[out] Char string built from current time.
    */
    char* getTimeDateString () {
        time_t currentTime = time (NULL);
        return getTimeDateString (currentTime);
    }

    /**
    * @brief Converts current time and date to a char string
    * @return Char string built from current time
    */
    char* getTimeDateStringUs () {
        timeval currentTime;
        gettimeofday (&currentTime, NULL);
        return getTimeDateString (currentTime);
    }
    
    /**
    * @brief Converts current time and date to a char string
    * @return Char string built from current time
    */
    char* getTimeDateStringForJS () {
        return getTimeDateString (time (NULL), "%02m/%02d/%04Y %02H:%02M:%02S");
    }
    
    /**
    * @brief Converts given time and date to a char string
    * @param moment `timeval` object to convert to String
    * @param format Format as printf
    * @return Char string built from current time
    */
    char* getTimeDateString (timeval moment, const char* format = "%02d/%02m/%04Y %02H:%02M:%02S") {
        tm* local_tm = localtime (&moment.tv_sec);
        size_t index = strftime (strBuffer, sizeof (strBuffer), format, local_tm);
        index += snprintf (strBuffer + index, sizeof (strBuffer) - index, ".%06ld", moment.tv_usec);
        strftime (strBuffer + index, sizeof (strBuffer) - index, " %Z", local_tm);
        return strBuffer;
    }

    /**
    * @brief Converts given time and date to a char string
    * @param moment `time_t` value (UNIX time) to convert to char string
    * @param format Format as printf
    * @return Char string built from current time
    */
    char* getTimeDateString (time_t moment, const char* format = "%02d/%02m/%04Y %02H:%02M:%02S") {
        tm* local_tm = localtime (&moment);
        strftime (strBuffer, sizeof (strBuffer), format, local_tm);

        return strBuffer;
    }
    
    /**
    * @brief Gets last successful sync time in UNIX format, with microseconds
    * @return Last successful sync time. 0 equals never
    */
    timeval getLastNTPSyncUs () {
        return lastSyncd;
    }

    
    /**
    * @brief Gets last successful sync time in UNIX format
    * @return Last successful sync time. 0 equals never
    */
    time_t getLastNTPSync (){
        return lastSyncd.tv_sec;
    }

    /**
    * @brief Gets uptime in human readable String format
    * @return Uptime
    */
    char* getUptimeString ();

    /**
    * @brief Gets uptime in UNIX format, time since MCU was last rebooted
    * @return Uptime
    */
    time_t getUptime () {
        uptime = uptime + (::millis () - uptime);
        return uptime / 1000;
    }

    /**
    * @brief Gets first successful synchronization time after boot
    * @return First sync time
    */
    timeval getFirstSyncUs () {
        return firstSync;
    }
    
    /**
    * @brief Gets first successful synchronization time after boot
    * @return First sync time
    */
    time_t getFirstSync () {
        return firstSync.tv_sec;
    }
    
    /**
    * @brief Returns sync status
    * @return Sync status as NTPStatus_t
    */
    NTPStatus_t syncStatus () {
        return status;
    }

    /**
     * @brief Gets milliseconds since 1-Jan-1970 00:00 UTC
     * @return Milliseconds since 1-Jan-1970 00:00 UTC
     */
    int64_t millis () {
        timeval currentTime;
        gettimeofday (&currentTime, NULL);
        int64_t milliseconds = (int64_t)currentTime.tv_sec * 1000L + (int64_t)currentTime.tv_usec / 1000L;
        //Serial.printf ("timeval: %ld.%ld millis %lld\n", currentTime.tv_sec, currentTime.tv_usec, milliseconds);
        return milliseconds;
    }
    
    /**
     * @brief Gets microseconds since 1-Jan-1970 00:00 UTC
     * @return microseconds since 1-Jan-1970 00:00 UTC
     */
    int64_t micros() {
        timeval currentTime;
        gettimeofday (&currentTime, NULL);
        int64_t microseconds = (int64_t)currentTime.tv_sec * 1000000L + (int64_t)currentTime.tv_usec;
        //Serial.printf ("timeval: %ld.%ld micros %lld\n", currentTime.tv_sec, currentTime.tv_usec, microseconds);
        return microseconds;
    }

    /**
     * @brief Gets text description from error. Useful for debugging
     * @param e NTP event
     * @return Text description
     */
    char* ntpEvent2str (NTPEvent_t e);

    /**
     * @brief Sets the number of sync attempts to calculate average offset
     * @param rounds Number of average rounds 1.. MAX_OFFSET_AVERAGE_ROUNDS
     */
    void setnumAveRounds (int rounds) {
        if (rounds < 1) {
            numAveRounds = 1;
        } else if (rounds > MAX_OFFSET_AVERAGE_ROUNDS) {
            numAveRounds = MAX_OFFSET_AVERAGE_ROUNDS;
        } else {
            numAveRounds = rounds;
        }
    }

    /**
     * @brief Gets the number of sync attempts to calculate average offset
     * @return Number of average rounds 1.. MAX_OFFSET_AVERAGE_ROUNDS
     */
    unsigned int getnumAveRounds () {
        return numAveRounds;
    }
    
};

extern NTPClient NTP; ///< @brief Singleton NTPClient instance

#endif // _NtpClientLib_h
